In [8]:
import pandas as pd
import numpy as np

In [2]:
unemp_county = pd.read_csv('C:/Users/Haier/Dataset/unemployment-by-county-us/output.csv')

In [4]:
unemp_county.head(4)

   Year     Month        State         County  Rate
0  2015  February  Mississippi  Newton County   6.1
1  2015  February  Mississippi  Panola County   9.4
2  2015  February  Mississippi  Monroe County   7.9
3  2015  February  Mississippi   Hinds County   6.1

In [5]:
df = pd.read_csv('us-minimum-wage-by-state-from-1968-to-2017/minwage.csv')

In [6]:
df.head()

,Unnamed: 0,Year,State,Table_Data,Footnote,High.Value,Low.Value,CPI.Average,High.2018,Low.2018
0,0,1968,Alabama,...,NaN,0.00000,0.00000,34.783333,0.00,0.00
1,1,1968,Alaska,2.10,NaN,2.10000,2.10000,34.783333,15.12,15.12
2,2,1968,Arizona,18.72 - 26.40/wk(b),(b),0.66000,0.46800,34.783333,4.75,3.37
3,3,1968,Arkansas,1.25/day(b),(b),0.15625,0.15625,34.783333,1.12,1.12
4,4,1968,California,1.65(b),(b),1.65000,1.65000,34.783333,11.88,11.88

In [7]:
act_min_age = pd.DataFrame()

for name, group in df.groupby('State'):
    
    if act_min_age.empty:
        act_min_age = group.set_index('Year')[['Low.2018']].rename(columns={'Low.2018':name})
    else:
        act_min_age = act_min_age.join(group.set_index('Year')[['Low.2018']].rename(columns={'Low.2018':name}))
  
act_min_age.head()

,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,District of Columbia,Federal (FLSA),...,Tennessee,Texas,U.S. Virgin Islands,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming
Year,,,,,,,,,,,,,,,,,,,,,
1968,0.0,15.12,3.37,1.12,11.88,7.20,10.08,9.00,9.00,8.28,...,0.0,0.00,NaN,7.20,10.08,0.0,11.52,7.20,9.00,8.64
1969,0.0,14.33,3.19,1.07,11.26,6.83,9.56,8.53,8.53,7.85,...,0.0,0.00,NaN,6.83,9.56,0.0,10.92,6.83,8.53,8.19
1970,0.0,13.54,3.02,7.09,10.64,6.45,10.32,8.06,10.32,8.38,...,0.0,0.00,NaN,6.45,10.32,0.0,10.32,6.45,8.38,8.38
1971,0.0,12.99,2.89,6.80,10.20,6.18,9.89,7.73,9.89,8.04,...,0.0,0.00,NaN,6.18,9.89,0.0,9.89,6.18,8.04,8.04
1972,0.0,12.57,2.80,7.19,9.88,5.99,11.08,9.58,9.58,9.58,...,0.0,8.38,NaN,7.19,9.58,0.0,9.58,7.19,8.68,8.98

In [12]:
act_min_wage = act_min_age.replace(0,np.NaN).dropna(axis=1) # remove those columns that have 0 values

In [11]:
act_min_wage.head(3)

,Alaska,Arkansas,California,Colorado,Connecticut,Delaware,District of Columbia,Federal (FLSA),Guam,Hawaii,...,Pennsylvania,Puerto Rico,Rhode Island,South Dakota,Utah,Vermont,Washington,West Virginia,Wisconsin,Wyoming
Year,,,,,,,,,,,,,,,,,,,,,
1968,15.12,1.12,11.88,7.20,10.08,9.00,9.00,8.28,9.00,9.00,...,8.28,3.10,10.08,3.06,7.20,10.08,11.52,7.20,9.00,8.64
1969,14.33,1.07,11.26,6.83,9.56,8.53,8.53,7.85,8.53,8.53,...,7.85,2.94,9.56,2.90,6.83,9.56,10.92,6.83,8.53,8.19
1970,13.54,7.09,10.64,6.45,10.32,8.06,10.32,8.38,10.32,10.32,...,8.38,2.77,10.32,6.45,6.45,10.32,10.32,6.45,8.38,8.38

In [13]:
def get_min_wage(year,state):
    try:
        return act_min_wage.loc[year][state]
    except:
        return np.NaN

In [14]:
get_min_wage(1968,'California')

11.88

In [18]:
?act_min_wage.loc

In [22]:
%%time 
# measures time 

unemp_county['min_wage'] = list(map(get_min_wage,unemp_county['Year'],unemp_county['State']))

Wall time: 4min 4s

In [34]:
 unemp_county.head(2)

   Year     Month        State         County  Rate  min_wage
0  2015  February  Mississippi  Newton County   6.1       NaN
1  2015  February  Mississippi  Panola County   9.4       NaN

In [32]:
unemp_county.tail(2)

        Year     Month  State              County  Rate  min_wage
885546  2009  November  Maine  Piscataquis County  11.3      8.46
885547  2009  November  Maine    Aroostook County   9.0      8.46

In [35]:
unemp_county[['Rate','min_wage']].corr()

              Rate  min_wage
Rate      1.000000  0.153047
min_wage  0.153047  1.000000

In [37]:
unemp_county[['Rate','min_wage']].cov()

              Rate  min_wage
Rate      9.687873  0.651586
min_wage  0.651586  1.874228

In [38]:
pred16  = pd.read_csv('C:/Users/Haier/Dataset/2016uspresidentialvotebycounty/pres16results.csv')

In [39]:
pred16.head(3)

,county,fips,cand,st,pct_report,votes,total_votes,pct,lead
0,NaN,US,Donald Trump,US,0.9951,60350241.0,127592176.0,0.472993,Donald Trump
1,NaN,US,Hillary Clinton,US,0.9951,60981118.0,127592176.0,0.477938,Donald Trump
2,NaN,US,Gary Johnson,US,0.9951,4164589.0,127592176.0,0.032640,Donald Trump

In [40]:
len(unemp_county)

885548

In [41]:
unemp_county.head()

   Year     Month        State         County  Rate  min_wage
0  2015  February  Mississippi  Newton County   6.1       NaN
1  2015  February  Mississippi  Panola County   9.4       NaN
2  2015  February  Mississippi  Monroe County   7.9       NaN
3  2015  February  Mississippi   Hinds County   6.1       NaN
4  2015  February  Mississippi  Kemper County  10.6       NaN

In [55]:
county_2015 = unemp_county.copy()[(unemp_county['Year']==2015) & (unemp_county['Month']=='February')]

In [44]:
county_2015 .head(2)

   Year     Month        State         County  Rate  min_wage
0  2015  February  Mississippi  Newton County   6.1       NaN
1  2015  February  Mississippi  Panola County   9.4       NaN

In [46]:
pred16['st'].unique()

array(['US', 'CA', 'FL', 'TX', 'NY', 'PA', 'IL', 'OH', 'MI', 'NC', 'GA',
       'VA', 'NJ', 'MA', 'WI', 'MN', 'MO', 'WA', 'IN', 'CO', 'TN', 'MD',
       'SC', 'AL', 'AZ', 'LA', 'KY', 'OR', 'CT', 'IA', 'OK', 'MS', 'KS',
       'NV', 'AR', 'UT', 'NE', 'NM', 'ME', 'NH', 'WV', 'ID', 'MT', 'RI',
       'DE', 'HI', 'SD', 'ND', 'VT', 'DC', 'WY', 'AK', nan], dtype=object)

In [47]:
state_abb = pd.read_csv('C:/Users/Haier/us-minimum-wage-by-state-from-1968-to-2017/sta_abb.csv',index_col = 0)

In [48]:
state_abb.head(2)

               Abbreviation Postal Code
State/District
Alabama                Ala.          AL
Alaska               Alaska          AK

In [49]:
state_abbrevation = state_abb[['Postal Code']]

In [50]:
state_abbrevation.head(2)

               Postal Code
State/District
Alabama                 AL
Alaska                  AK

In [52]:
stat_abb_dict = state_abbrevation.to_dict()

In [53]:
 stat_abb_dict = stat_abb_dict['Postal Code']

In [54]:
stat_abb_dict

{'Alabama': 'AL',
 'Alaska': 'AK',
 'Arizona': 'AZ',
 'Arkansas': 'AR',
 'California': 'CA',
 'Colorado': 'CO',
 'Connecticut': 'CT',
 'Delaware': 'DE',
 'District of Columbia': 'DC',
 'Florida': 'FL',
 'Georgia': 'GA',
 'Hawaii': 'HI',
 'Idaho': 'ID',
 'Illinois': 'IL',
 'Indiana': 'IN',
 'Iowa': 'IA',
 'Kansas': 'KS',
 'Kentucky': 'KY',
 'Louisiana': 'LA',
 'Maine': 'ME',
 'Maryland': 'MD',
 'Massachusetts': 'MA',
 'Michigan': 'MI',
 'Minnesota': 'MN',
 'Mississippi': 'MS',
 'Missouri': 'MO',
 'Montana': 'MT',
 'Nebraska': 'NE',
 'Nevada': 'NV',
 'New Hampshire': 'NH',
 'New Jersey': 'NJ',
 'New Mexico': 'NM',
 'New York': 'NY',
 'North Carolina': 'NC',
 'North Dakota': 'ND',
 'Ohio': 'OH',
 'Oklahoma': 'OK',
 'Oregon': 'OR',
 'Pennsylvania': 'PA',
 'Rhode Island': 'RI',
 'South Carolina': 'SC',
 'South Dakota': 'SD',
 'Tennessee': 'TN',
 'Texas': 'TX',
 'Utah': 'UT',
 'Vermont': 'VT',
 'Virginia': 'VA',
 'Washington': 'WA',
 'West Virginia': 'WV',
 'Wisconsin': 'WI',
 'Wyoming': 'WY'}

In [59]:
county_2015['State'] = county_2015['State'].map(stat_abb_dict)

In [61]:
county_2015.tail(2)

      Year     Month State              County  Rate  min_wage
2800  2015  February    ME  Piscataquis County   7.0      7.92
2801  2015  February    ME    Aroostook County   7.2      7.92

In [64]:
print(len(pred16))
print(len(county_2015))

18475
2802

In [65]:
pred16.columns

Index(['county', 'fips', 'cand', 'st', 'pct_report', 'votes', 'total_votes',
       'pct', 'lead'],
      dtype='object')

In [66]:
county_2015.columns

Index(['Year', 'Month', 'State', 'County', 'Rate', 'min_wage'], dtype='object')

In [68]:
pred16.rename(columns = {'county':'County','st':'State'},inplace=True)

In [69]:
pred16.head(2)

,County,fips,cand,State,pct_report,votes,total_votes,pct,lead
0,NaN,US,Donald Trump,US,0.9951,60350241.0,127592176.0,0.472993,Donald Trump
1,NaN,US,Hillary Clinton,US,0.9951,60981118.0,127592176.0,0.477938,Donald Trump

In [70]:
for df in [county_2015,pred16]:
    df.set_index(['County','State'],inplace=True)

In [71]:
pred16.head(2)

             fips             cand  pct_report       votes  total_votes  \
County State
NaN    US      US     Donald Trump      0.9951  60350241.0  127592176.0
       US      US  Hillary Clinton      0.9951  60981118.0  127592176.0

                   pct          lead
County State
NaN    US     0.472993  Donald Trump
       US     0.477938  Donald Trump

In [76]:
pred16_new = pred16[pred16['cand']=='Donald Trump']
pred16_new = pred16_new[['pct']]
pred16_new.dropna(inplace=True)

In [104]:
pred16_new.head(2)
#print(len(pred16_new))

                   pct
County State
NaN    US     0.472993
       CA     0.330641

In [83]:
len(county_2015)

2802

In [101]:
all_together = county_2015.merge(pred16_new,on=['County','State'])
all_together.dropna(inplace=True)

In [103]:
all_together.tail(2)

                          Year     Month  Rate  min_wage       pct
County             State
Piscataquis County ME     2015  February   7.0      7.92  0.590879
Aroostook County   ME     2015  February   7.2      7.92  0.555416

In [80]:
len(all_together)

1557

In [85]:
all_together.drop('Year',axis=1,inplace=True)

In [86]:
all_together.head(2)

                              Month  Rate  min_wage       pct
County              State
Major County        OK     February   2.6      2.11  0.864960
Pottawatomie County OK     February   4.5      2.11  0.701342

In [87]:
all_together.corr()

              Rate  min_wage       pct
Rate      1.000000  0.186689 -0.085985
min_wage  0.186689  1.000000 -0.325036
pct      -0.085985 -0.325036  1.000000

In [88]:
all_together.cov()

              Rate  min_wage       pct
Rate      5.743199  0.683870 -0.031771
min_wage  0.683870  2.336451 -0.076602
pct      -0.031771 -0.076602  0.023772

In [91]:
?all_together.dropna

<------------------------------------------------------------>